Reports/абс_ПросроченнаяДебиторскаяЗадолженностьПоСрокамДолга/абс_ПросроченнаяДебиторскаяЗадолженностьПоСрокамДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>абс_ПросроченнаяДебиторскаяЗадолженностьПоСрокамДолга</name>
  <attributes>
    <name>УниверсальныйОтчет</name>
    <type>
      <types>ReportObject.УниверсальныйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>Интервал</name>
    <type>
      <types>CatalogRef.НастройкаИнтервалов</types>
    </type>
  </attributes>
</mdclass:Report>

AccumulationRegisters/ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов/ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов</name>
  <comment>(Общ) Оперативное ведение расчетов с контрагентами по договорам с учетом расчетов по документам</comment>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <comment>Сумма в валюте регламентированного учета для договоров в у.е. </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРасчетовСКонтрагентом</name>
    <comment>Незакрытый документ поставки/оплаты</comment>
    <type>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ОтражениеПоступленияТоваровИУслугНДС</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ОтражениеРеализацииТоваровИУслугНДС</types>
      <types>DocumentRef.ОплатаОтПокупателяПлатежнойКартой</types>
      <types>DocumentRef.ВозвратТоваровПоставщикуИзНТТ</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.АккредитивПолученный</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПлатежноеТребованиеПолученное</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АккредитивПереданный</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.КорректировкаДолгаПоВозвратнойТаре</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеНМА</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.ИнкассовоеПоручениеПолученное</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПлатежноеТребованиеВыставленное</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      <types>DocumentRef.ПередачаНМА</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      <types>DocumentRef.ИнкассовоеПоручениеПереданное</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчетовСКонтрагентом</name>
    <comment>Вид расчетов (по приобретению, по реализации, прочее)</comment>
    <type>
      <types>EnumRef.ВидыРасчетовСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УпрУчет</name>
    <comment>Отражается ли документ расчетов с контрагентами в управленческом учете</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Reports/абс_ПросроченнаяДебиторскаяЗадолженностьПоСрокамДолга/ObjectModule.bsl
Перем ТабИнтервалы;

#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

Процедура УстановитьТекстЗапроса()
	
	КолИнтервалов = ТабИнтервалы.Количество();
	
	//+Лео Сафонов ЕА по запросу Воронова. Долг по договорам с поставщика
	//ТекстПоказателей="
	//|   ТаблицаЗадолженности.ОстатокДолга КАК ОстатокДолга,
	//|	ТаблицаЗадолженности.НашДолг КАК НашДолг"; 
	
	ТекстПоказателей="
	|   ТаблицаЗадолженности.ОстатокДолга КАК ОстатокДолга,
	|   ТаблицаЗадолженности.ДолгПередПоставщиком КАК ДолгПередПоставщиком,
	|	ТаблицаЗадолженности.НашДолг КАК НашДолг,
	|ВЫБОР
	|	КОГДА ТаблицаЗадолженности.ДатаОплаты < НАЧАЛОПЕРИОДА(&ДатаОстатков, ДЕНЬ)
	|		ТОГДА ТаблицаЗадолженности.ОстатокДолга
	|	ИНАЧЕ 0
	|КОНЕЦ - ТаблицаЗадолженности.ДолгПередПоставщиком КАК РазницаПросроченоИДолгПередПоставщиком"; 
    //-Лео Сафонов ЕА по запросу Воронова. Долг по договорам с поставщика
	Для Ном = 1 По КолИнтервалов - 1 Цикл
		ТекстПоказателей=ТекстПоказателей+",
		|ВЫБОР
		|КОГДА ТаблицаЗадолженности.ДатаОплаты МЕЖДУ &НачалоИнтервала"+Ном+" И &КонецИнтервала"+Ном+"
		|ТОГДА ТаблицаЗадолженности.ОстатокДолга
		|ИНАЧЕ 0
		|КОНЕЦ КАК ОстатокПериода" + Ном;
	КонецЦикла;
	Если КолИнтервалов > 0 Тогда
		ТекстПоказателей=ТекстПоказателей+",
		|ВЫБОР
		|КОГДА ТаблицаЗадолженности.ДатаОплаты < &КонецИнтервала"+КолИнтервалов+"
		|ТОГДА ТаблицаЗадолженности.ОстатокДолга
		|ИНАЧЕ 0
		|КОНЕЦ КАК ОстатокПериода" + КолИнтервалов;
	КонецЕсли;

	//+Лео Сафонов ЕА по запросу Воронова. Долг по договорам с поставщика
	
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента,
	//|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Сделка,
	//|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом,
	//|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация,
	//|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент,
	//|	ВЫБОР КОГДА ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток > 0 
	//|		ТОГДА ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток
	//|		ИНАЧЕ 0 
	//|	КОНЕЦ КАК ОстатокДолга,
	//|	ВЫБОР КОГДА ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток < 0 
	//|		ТОГДА -ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток
	//|		ИНАЧЕ 0 
	//|	КОНЕЦ КАК НашДолг,
	//|	ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом КАК Документ.РеализацияТоваровУслуг).абс_ДатаОплаты КАК ДатаОплаты
	//|ПОМЕСТИТЬ ТаблицаЗадолженности
	//|ИЗ
	//|	//+Лео Сафонов ЕА
	//|   //РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(&ДатаОстатков, ) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	//|   //-Лео Сафонов ЕА
	//|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(&ДатаСрезаОстатков, ) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	//|ГДЕ
	//|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ВидДоговора = Значение(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	//|;
	
	
	ТекстЗапроса=	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ДоговорКонтрагента,
	|	ВложенныйЗапрос.Сделка,
	|	ВложенныйЗапрос.ДокументРасчетовСКонтрагентом,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Контрагент,
	|	СУММА(ВложенныйЗапрос.ОстатокДолга) КАК ОстатокДолга,
	|	СУММА(ВложенныйЗапрос.НашДолг) КАК НашДолг,
	|	ЕСТЬNULL(ВложенныйЗапрос.ДатаОплаты, &ДатаСрезаОстатков) КАК ДатаОплаты,
	|	СУММА(ВложенныйЗапрос.ДолгПередПоставщиком) КАК ДолгПередПоставщиком
	|ПОМЕСТИТЬ ТаблицаЗадолженности
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент КАК Контрагент,
	|		СУММА(ВЫБОР
	|				КОГДА ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток > 0
	|					ТОГДА ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК ОстатокДолга,
	|		СУММА(ВЫБОР
	|				КОГДА ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток < 0
	|					ТОГДА -ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК НашДолг
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(&ДатаСрезаОстатков, ) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	|	ГДЕ
	|		ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент) КАК ПокупателиСЗадолженностью
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТаблицаЗадолженностиСПокупателями.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|			ТаблицаЗадолженностиСПокупателями.Сделка КАК Сделка,
	|			ТаблицаЗадолженностиСПокупателями.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
	|			ТаблицаЗадолженностиСПокупателями.Организация КАК Организация,
	|			ТаблицаЗадолженностиСПокупателями.Контрагент КАК Контрагент,
	|			ТаблицаЗадолженностиСПокупателями.ОстатокДолга КАК ОстатокДолга,
	|			ТаблицаЗадолженностиСПокупателями.НашДолг КАК НашДолг,
	|			ТаблицаЗадолженностиСПокупателями.ДатаОплаты КАК ДатаОплаты,
	|			0 КАК ДолгПередПоставщиком
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|				ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Сделка КАК Сделка,
	|				ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
	|				ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация КАК Организация,
	|				ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент КАК Контрагент,
	|				ВЫБОР
	|					КОГДА ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток > 0
	|						ТОГДА ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток
	|					ИНАЧЕ 0
	|				КОНЕЦ КАК ОстатокДолга,
	|				ВЫБОР
	|					КОГДА ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток < 0
	|						ТОГДА -ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток
	|					ИНАЧЕ 0
	|				КОНЕЦ КАК НашДолг,
	|				ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом КАК Документ.РеализацияТоваровУслуг).абс_ДатаОплаты КАК ДатаОплаты
	|			ИЗ
	|				РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(&ДатаСрезаОстатков, ) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	|			ГДЕ
	|				ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)) КАК ТаблицаЗадолженностиСПокупателями
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ТаблицаЗадолженностиСПоставщиками.ДоговорКонтрагента,
	|			ТаблицаЗадолженностиСПоставщиками.Сделка,
	|			"""",
	|			ТаблицаЗадолженностиСПоставщиками.Организация,
	|			ТаблицаЗадолженностиСПоставщиками.Контрагент,
	|			0,
	|			0,
	|			&ДатаСрезаОстатков,
	|			ТаблицаЗадолженностиСПоставщиками.ДолгПередПоставщиком
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|				ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Сделка КАК Сделка,
	|				ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
	|				ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация КАК Организация,
	|				ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент КАК Контрагент,
	|				ВЫБОР
	|					КОГДА ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток > 0
	|						ТОГДА ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток
	|					ИНАЧЕ 0
	|				КОНЕЦ КАК ОстатокДолга,
	|				ВЫБОР
	|					КОГДА ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток < 0
	|						ТОГДА -ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток
	|					ИНАЧЕ 0
	|				КОНЕЦ КАК ДолгПередПоставщиком,
	|				ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом КАК Документ.РеализацияТоваровУслуг).абс_ДатаОплаты КАК ДатаОплаты
	|			ИЗ
	|				РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(&ДатаСрезаОстатков, ) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	|			ГДЕ
	|				ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)) КАК ТаблицаЗадолженностиСПоставщиками) КАК ВложенныйЗапрос
	|		ПО (ВложенныйЗапрос.Контрагент = ПокупателиСЗадолженностью.Контрагент)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ДоговорКонтрагента,
	|	ВложенныйЗапрос.Сделка,
	|	ВложенныйЗапрос.ДокументРасчетовСКонтрагентом,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Контрагент,
	|	ЕСТЬNULL(ВложенныйЗапрос.ДатаОплаты, &ДатаСрезаОстатков)
	|;
    |//+Лео Сафонов ЕА по запросу Воронова. Долг по договорам с поставщика
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗадолженности.Организация КАК Организация,
	|	ТаблицаЗадолженности.Организация.Представление КАК ОрганизацияПредставление,
	|	ТаблицаЗадолженности.Контрагент КАК Контрагент,
	|	ТаблицаЗадолженности.Контрагент.Представление КАК КонтрагентПредставление,
	|	ТаблицаЗадолженности.Контрагент.абс_БизнесРегион КАК БизнесРегион,
	|	ТаблицаЗадолженности.Контрагент.абс_Территория КАК Территория,
	|	ТаблицаЗадолженности.Контрагент.абс_Город КАК Город,
	|	ТаблицаЗадолженности.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТаблицаЗадолженности.ДоговорКонтрагента.Представление КАК ДоговорКонтрагентаПредставление,
	|	ТаблицаЗадолженности.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаЗадолженности.ДоговорКонтрагента.ВалютаВзаиморасчетов.Представление КАК ВалютаВзаиморасчетовПредставление,
	|	ТаблицаЗадолженности.ДоговорКонтрагента.КонтролироватьЧислоДнейЗадолженности КАК КонтролироватьЗадолженность,
	|	ТаблицаЗадолженности.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности КАК ЧислоДнейЗадолженности,
	|	ТаблицаЗадолженности.Сделка КАК Сделка,
	|	ТаблицаЗадолженности.Сделка.Представление КАК СделкаПредставление,
	|	ТаблицаЗадолженности.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
	|	ТаблицаЗадолженности.ДокументРасчетовСКонтрагентом.Представление КАК ДокументРасчетовСКонтрагентомПредставление,
	|	ТаблицаЗадолженности.ДатаОплаты КАК ДатаОплаты,
	|	ВЫБОР КОГДА РазностьДат(ТаблицаЗадолженности.ДатаОплаты,&ДатаОстатков,День) >0 И ТаблицаЗадолженности.ОстатокДолга>0
	|		ТОГДА РазностьДат(ТаблицаЗадолженности.ДатаОплаты,&ДатаОстатков,День)
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК КоличествоДнейПросрочки,
	|	0 КАК ПроцентПДЗ,
	|	ВЫБОР
	|	КОГДА ТаблицаЗадолженности.ДатаОплаты<НАЧАЛОПЕРИОДА(&ДатаОстатков,День)
	|	ТОГДА ОстатокДолга
	|	ИНАЧЕ 0
	|	КОНЕЦ КАК ПросроченнаяЗадолженность,"
	+ ТекстПоказателей + "
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	Организация.*,
	|	Контрагент.*,
	|	БизнесРегион.*,
	|	Территория.*,
	|	Город.*,
	|	ДоговорКонтрагента.*,
	|	ВалютаВзаиморасчетов.*,
	|	КонтролироватьЗадолженность,
	|	ЧислоДнейЗадолженности,
	|	Сделка.*,
	|	ДокументРасчетовСКонтрагентом.*,
	|	ДатаОплаты,
	|	КоличествоДнейПросрочки,
	|	ПроцентПДЗ,
	|	ПросроченнаяЗадолженность,"
	+ ТекстПоказателей + "
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИЗ ТаблицаЗадолженности КАК ТаблицаЗадолженности
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	ТаблицаЗадолженности.Контрагент,ДоговорКонтрагента,"
	+ ТекстПоказателей + "
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}
	|{УПОРЯДОЧИТЬ ПО
	|	Организация.*,
	|	БизнесРегион.*,
	|	Территория.*,
	|	Город.*,
	|	Контрагент.*,
	|	ДоговорКонтрагента.*,
	|	Сделка.*,
	|	ДокументРасчетовСКонтрагентом.*,
	|	ВалютаВзаиморасчетов.*,
	|	КонтролироватьЗадолженность,
	|	ЧислоДнейЗадолженности,
	|	ДатаОплаты,
	|	КоличествоДнейПросрочки,
	|	ПроцентПДЗ,
	|	ПросроченнаяЗадолженность,
	|	ОстатокДолга
	|	НашДолг";
	Для Ном = 1 По КолИнтервалов Цикл
		ТекстЗапроса = ТекстЗапроса + ",
		|	ОстатокПериода" + Ном;
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + "
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИТОГИ
	|	СУММА(ПросроченнаяЗадолженность),
	|	МИНИМУМ(ДатаОплаты),
	|	МАКСИМУМ(КоличествоДнейПросрочки),
	|	ВЫБОР 
	|		КОГДА СУММА(ОстатокДолга)=0 
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(ПросроченнаяЗадолженность)/СУММА(ОстатокДолга)*100 
	|	КОНЕЦ КАК ПроцентПДЗ,
	|	СУММА(ОстатокДолга),
	|	СУММА(ДолгПередПоставщиком),
	|	СУММА(НашДолг),
	|	СУММА(РазницаПросроченоИДолгПередПоставщиком)";
	Для Ном = 1 По КолИнтервалов Цикл
		ТекстЗапроса = ТекстЗапроса + ",
		|	СУММА(ОстатокПериода" + Ном + ")";
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + "
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Организация.*,
	|	БизнесРегион.*,
	|	Территория.*,
	|	Город.*,
	|	Контрагент.*,
	|	ДоговорКонтрагента.*,
	|	Контрагент.*,
	|	Сделка.*,
	|	ДокументРасчетовСКонтрагентом.*,
	|	ВалютаВзаиморасчетов.*
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ТаблицаЗадолженности.Контрагент", "Контрагент", "Контрагент", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ТаблицаЗадолженности.ДоговорКонтрагента", "ДоговорКонтрагента", "Договор контрагента", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ДоговорыКонтрагентов);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ТаблицаЗадолженности.Организация", "Организация", "Организация", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);

		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;

КонецПроцедуры

Процедура УстановитьИнтервалыЗапроса()

	ТабИнтервалы = Новый ТаблицаЗначений;
	ТабИнтервалы.Колонки.Добавить("ИмяИнтервала");
	ТабИнтервалы.Колонки.Добавить("НомерИнтервала");
	ТабИнтервалы.Колонки.Добавить("НачалоИнтервала");
	ТабИнтервалы.Колонки.Добавить("КонецИнтервала");
	
	Для каждого СтрокаТабЧасти из Интервал.ТабличнаяЧасть Цикл
		НоваяСтрока = ТабИнтервалы.Добавить();
		НоваяСтрока.ИмяИнтервала    = СтрокаТабЧасти.Подпись;
		НоваяСтрока.НомерИнтервала  = СтрокаТабЧасти.НомерСтроки;
		НоваяСтрока.НачалоИнтервала = НачалоДня(НачалоДня(УниверсальныйОтчет.ДатаКон)-1) - (СтрокаТабЧасти.НачалоИнтервала-1) * 60 * 60 * 24;
		Если ТабИнтервалы.Количество()=1 Тогда
			НоваяСтрока.КонецИнтервала  = КонецДня(НачалоДня(УниверсальныйОтчет.ДатаКон)-1)  - СтрокаТабЧасти.КонецИнтервала * 60 * 60 * 24;
		Иначе
			НоваяСтрока.КонецИнтервала  = КонецДня(НачалоДня(УниверсальныйОтчет.ДатаКон)-1)  - (СтрокаТабЧасти.КонецИнтервала-1) * 60 * 60 * 24;
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыПостроителя = УниверсальныйОтчет.ПостроительОтчета.Параметры;
	ПараметрыПостроителя.Вставить("ДатаОстатков", КонецДня(УниверсальныйОтчет.ДатаКон));
	//+Лео Сафонов ЕА 
	ПараметрыПостроителя.Вставить("ДатаСрезаОстатков", КонецДня(УниверсальныйОтчет.ДатаКон)+1);
	//-Лео Сафонов ЕА
	Для каждого СтрокаИнтервала из ТабИнтервалы Цикл
		ПараметрыПостроителя.Вставить("НачалоИнтервала" + СтрокаИнтервала.НомерИнтервала, СтрокаИнтервала.НачалоИнтервала);
		ПараметрыПостроителя.Вставить("КонецИнтервала"  + СтрокаИнтервала.НомерИнтервала, СтрокаИнтервала.КонецИнтервала);
	КонецЦикла;
	
КонецПроцедуры

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
		
	КонецЕсли;
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	
	УниверсальныйОтчет.ДатаКон = ?(ЗначениеЗаполнено(УниверсальныйОтчет.ДатаКон), УниверсальныйОтчет.ДатаКон, КонецДня(РабочаяДата));
	
	УстановитьИнтервалыЗапроса();
	
	УстановитьТекстЗапроса();
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорКонтрагента", "Договор контрагента");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("БизнесРегион", "Бизнес-регион");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДокументРасчетовСКонтрагентом", "Документ расчетов с контрагентом");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВалютаВзаиморасчетов", "Валюта взаиморасчетов");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ОстатокДолга", "Дебиторская задолженность по договорам с Покупателями");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НашДолг", "Наш долг по договорам с Покупателями");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ПросроченнаяЗадолженность", "Просроченная задолженность по договорам с Покупателями");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДатаОплаты", "Дата оплаты");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КонтролироватьЗадолженность", "Контролировать задолженность");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЧислоДнейЗадолженности", "Число дней задолженности не более");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоДнейПросрочки", "Количество дней просрочки");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ПроцентПДЗ", "% ПДЗ");
    //+Лео Сафонов ЕА по запросу Воронова. Долг по договорам с поставщика
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДолгПередПоставщиком", "Наш долг по Договорам с Поставщиками");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("РазницаПросроченоИДолгПередПоставщиком", "Просроченная задолженность Покупателей за вычетом нашего долга перед Поставщиками");
    //-Лео Сафонов ЕА по запросу Воронова. Долг по договорам с поставщика

	
	Для каждого СтрокаИнтервала из ТабИнтервалы Цикл
		Ном = СтрокаИнтервала.НомерИнтервала;
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ОстатокПериода" + Ном, СтрокаИнтервала.ИмяИнтервала);
	КонецЦикла;
	                                                                        
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	УниверсальныйОтчет.ДобавитьПоказатель("ДатаОплаты", "Дата оплаты", Истина, "ДФ=дд.ММ.гггг", , );
	УниверсальныйОтчет.ДобавитьПоказатель("КонтролироватьЗадолженность", "Контролировать задолженность", Истина, "БЛ=Нет; БИ=Да", , );
	УниверсальныйОтчет.ДобавитьПоказатель("ЧислоДнейЗадолженности", "Число дней задолженности не более", Истина, "ЧДЦ=0", , );
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоДнейПросрочки", "Количество дней просрочки", Истина, "ЧДЦ=0",,);
	УниверсальныйОтчет.ДобавитьПоказатель("НашДолг", "Наш долг по договорам с Покупателями", Истина, "ЧЦ=15; ЧДЦ=2",,);
	УниверсальныйОтчет.ДобавитьПоказатель("ОстатокДолга", "Дебиторская задолженность по договорам с Покупателями", Истина, "ЧЦ=15; ЧДЦ=2",,);
	УниверсальныйОтчет.ДобавитьПоказатель("ПросроченнаяЗадолженность", "Просроченная задолженность по договорам с Покупателями", Истина, "ЧЦ=15; ЧДЦ=2",,);
	УниверсальныйОтчет.ДобавитьПоказатель("ПроцентПДЗ", "% ПДЗ", Истина, "ЧЦ=5; ЧДЦ=1",,);

	//+Лео Сафонов ЕА по запросу Воронова. Долг по договорам с поставщика
	УниверсальныйОтчет.ДобавитьПоказатель("ДолгПередПоставщиком", "Наш долг по Договорам с Поставщиками", Истина, "ЧЦ=15; ЧДЦ=2",,);
	УниверсальныйОтчет.ДобавитьПоказатель("РазницаПросроченоИДолгПередПоставщиком", "Просроченная задолженность Покупателей за вычетом нашего долга перед Поставщиками", Истина,"ЧЦ=15; ЧДЦ=2", , );
    //-Лео Сафонов ЕА по запросу Воронова. Долг по договорам с поставщика

	
	Для каждого СтрокаИнтервала из ТабИнтервалы Цикл
		Ном = СтрокаИнтервала.НомерИнтервала;
		УниверсальныйОтчет.ДобавитьПоказатель("ОстатокПериода" + Ном, СтрокаИнтервала.ИмяИнтервала, Истина, "ЧЦ=15; ЧДЦ=2", "ПоПериодам", "В т.ч. по срокам возникновения долга:");
	КонецЦикла;
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ВалютаВзаиморасчетов");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("БизнесРегион");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Территория");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Город");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Контрагент");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ДоговорКонтрагента");

	

	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Контрагент");
	УниверсальныйОтчет.ДобавитьОтбор("ДоговорКонтрагента");
	УниверсальныйОтчет.ДобавитьОтбор("ОстатокДолга", , ВидСравнения.Больше, 0, , , Ложь);
	УниверсальныйОтчет.ДобавитьОтбор("НашДолг", , ВидСравнения.Равно, 0, , , Ложь);
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	УниверсальныйОтчет.УстановитьСвязьПолей("ВалютаВзаиморасчетов", "ДоговорКонтрагента");
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;

	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ВалютаВзаиморасчетов");

КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Интервал) Тогда
		Сообщить("Отчет может быть сформирован только при выбранном интервале.", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	// Перед формированием отчета можно установить необходимые параметры универсального отчета.
	
	УстановитьИнтервалыЗапроса();
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент,,, ЭтотОбъект);

КонецПроцедуры // СформироватьОтчет()

Функция ПолучитьТекстСправкиФормы() Экспорт
	
	Возврат "";
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: // (-1) - не выбирать период, 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0

УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
